// ==========================================================
// 6.12. Стан запитів: помилки та завантаження
// ==========================================================
// Next.js дозволяє відловлювати помилки й відображати власний інтерфейс замість "падіння" сторінки. У Next.js ви можете створити файл error.tsx безпосередньо у папці маршруту.
// ** error.tsx завжди рендериться на клієнті, тому обов’язково має містити директиву 'use client'
// ** До компонента передається об’єкт помилки
// ** Ви можете відобразити повідомлення або надати опцію повторити спробу
// -------------------------------------------------------
//
// app/notes/error.tsx

"use client";

type Props = {
  error: Error;
  reset: () => void;
};

const Error = ({ error, reset }: Props) => {
  return (
    <div>
      <h2>Помилка при завантаженні</h2>
      <p>{error.message}</p>
      <button onClick={reset}>Спробувати знову</button>
    </div>
  );
};

export default Error;
