// ==========================================================
// 6.12. Стан запитів: помилки та завантаження / Loader
// ==========================================================
// Щоб протестувати завантаження (app/notes/loading.tsx), додамо штучну паузу у getNotes (lib/api.ts)
// -----------------
// Підсумок
// -----------------
// Помилки обробляються в error.tsx
// Завантаження обробляється у loading.tsx
// Все це працює автоматично, якщо компоненти знаходяться поруч із page.tsx
// Ви можете перевизначати логіку для кожного маршруту окремо
// ----------------------------------------------------------
//
// app/notes/loading.tsx

const Loading = () => {
  return <p>Завантаження нотатків...</p>;
};
export default Loading;
