// ==========================================================
// 6.14 Завантаження даних у клієнтському компоненті
// ==========================================================
// Проблема: обробка подій у серверному компоненті
//
// Сторінка деталей – це серверний компонент, який виконується на сервері. Користувач отримує вже згенерований HTML без клієнтських обробників подій.
// Замість того щоб робити всю сторінку клієнтською (що спричинило б інші проблеми), ми залишаємо page.tsx серверним, а вміст переносимо у клієнтський компонент.
// -------------------------
// Структура:
// -------------------------
// app/notes/[id]/page.tsx – залишаємо page.tsx серверним
// app/notes/[id]/NoteDetails.client.tsx – створюємо окремий клієнтський компонент для інтерактивного вмісту
// ----------------------------------------------------------
// 1) Почнемо з підключення провайдера React Query, щоб усі клієнтські компоненти могли використовувати useQuery, кеш і мутації. У папці components створимо клієнтський компонент TanStackProvider, завдання якого дати доступ до queryClient усім дочірнім компонентам.
// components/TanStackProvider/TanStackProvider.tsx
// -----------------------
// 2) Провайдер підключається один раз на весь проєкт, тому зробимо це в головному шаблоні app/layout.tsx який огортає всі компоненти додатка.
// -----------------------
// 3) Prefetch і кешування
// Далі, до серверного компонента app/notes/[id]/page.tsx повертаємо логіку читання ідентифікатора із параметрів. Також додамо код, щоб компонент завантажував дані заздалегідь (prefetch): app/notes/[id]/page.tsx
// *** prefetchQuery – функція, яка завчасно завантажить нам ці нотатки та збереже їх у кеш на сервері. Завдяки цьому при виклику useQuery у клієнтському компоненті, дані вже будуть доступні – без повторного запиту.
// *** queryKey – ключ, за яким дані будуть збережені у кеш
// *** queryFn – функція HTTP-запиту
// Для того, щоб використати ці дані в клієнтському компоненті, необхідно використати HydrationBoundary із React Query:
// *** HydrationBoundary – компонент, передає кеш клієнту
// *** dehydrate(queryClient) – перетворює кеш у серіалізований обʼєкт
// -----------------------
// 4) Вивід даних у клієнтському компоненті
// Тепер в клієнтському компоненті необхідно також отримати ідентифікатор нотатки із URL через useParams, додати хук useQuery та опрацювати дані:
// *** useParams – хук для клієнтських компонентів, який повертає об'єкт із динамічними параметрами поточного маршруту, підставленими з URL; він не приймає жодних аргументів.
// *** В useQuery потрібно передати той же queryKey, що і для prefetchQuery, щоб дістати із кешу дані відповідної нотатки.
// *** Також обов'язково вказуємо, що нам не потрібен повторний запит при монтуванні клієнтського компонента (refetchOnMount: false). Це вимикає повторний запит при монтуванні, оскільки дані вже є з prefetchQuery.
// ------------------------------------------------------------
// Що ми отримали:
// ------------------------------------------------------------
// SSR-запит у page.tsx – дані приходять на сервер
// // app/notes/[id]/page.tsx

// Дані кешуються через prefetchQuery
// // app/notes/[id]/page.tsx

// HydrationBoundary передає кеш клієнту
// // app/notes/[id]/page.tsx

// useQuery у клієнтському компоненті дістає ці дані з кешу
// app/notes/[id]/NoteDetails.client.tsx

// У браузер потрапляє згенерований HTML, а React Query забезпечує інтерактивність без додаткових запитів.
// ==========================================================
//
// app/notes/[id]/NoteDetails.client.tsx

"use client";

import { useQuery } from "@tanstack/react-query";
import { useParams } from "next/navigation";
import { getSingleNote } from "@/lib/api";

const NoteDetailsClient = () => {
  const { id } = useParams<{ id: string }>();

  const {
    data: note,
    isLoading,
    error,
  } = useQuery({
    queryKey: ["note", id],
    queryFn: () => getSingleNote(id),
    refetchOnMount: false,
  });

  if (isLoading) return <p>Loading...</p>;

  if (error || !note) return <p>Some error..</p>;

  const formattedDate = note.updatedAt
    ? `Updated at: ${note.updatedAt}`
    : `Created at: ${note.createdAt}`;

  return (
    <div>
      <h2>{note.title}</h2>
      <p>{note.content}</p>
      <p>{formattedDate}</p>
    </div>
  );
};

export default NoteDetailsClient;
